#include <stdio.h> 
#include <stdlib.h>
int maingcdgfguhu()
{
char a[10] = { '1','2','3','4','5','6','7','8' }, *p; int i;
i = 8;
p = a + i;
printf("%s\n", p - 3);
/* 注意后面有补零的操作,输出678,空的自动补零，并且输出时内存读取，和单个存入的字符没有关系 */
system("pause");
return 0;
}
/* 由多个源文件组成的C程序，经过编辑、预处理、编译、链接等阶段会生成最终的可执行程序。下面哪个阶段可以发现被调用的函数未定义(C)？
A 预处理
B 编译
C 链接
D 执行

以下哪种STL容器中的对象是连续存储的:(B)
A list
B vector
C map
D set



下面关于一个类的静态成员描述中,不正确的是(C)
A 静态成员变量可被该类的所有方法访问
B 该类的静态方法只能访问该类的静态成员函数
C 该类的静态数据成员变量的值不可修改
D 子类可以访问父类的静态成员
E 静态成员无多态特性
 */



