//#include <iostream>
//using namespace std;
//class type
//{
//	virtual type()
//	{
//
//	}
//};
//int main()
//{
//
//	system("pause"); 
//	return 0;
//}  
//类的构造函数不能使用虚函数


/* 柔性数组
void * data[]       柔性数组  
不占用空间 数组名存在常量区，用处是可以用malloc给它开辟空间，数组名会指向
这片空间的起始，例如  malloc(100*sizeof(int *) void 表示任意类型 可以用下标
去操作这空间  

下列对重载函数的描述中，________A____是错误的。
A 重载函数中不允许使用默认参数
B 重载函数中编译时根据参数表进行选择
C 构造函数重载将会给初始化带来多种方式
D 不要使用重载函数来描述毫无相干的函数
*/ 
/* 下列关于多态性说法不正确的是（ B）。
A 多态性是指同名函数对应多种不同的实现
B 重载方式仅有函数重载
C 重载方式包含函数重载和运算符重载
D 多态性表现为静态和动态两种方式 
定义char dog[]="wang\0miao";那么sizeof(dog)与strlen(dog)分别是多少：A
A 10,4
B 4,4
C 9,9
D 9,4
假设寄存器为8位，用补码形式存储机器数，包括一位符号位，那么十进制数-25在寄存器表示为：D
A 67H
B 99H
C E6H
D E7H

*/
